[
  {
    "section_title": "Projects",
    "works": [
        {
          "title":"This Website:",
          "subtitle": "Creator",
          "detail":"This website is written in Angular JS 2,3,4,5 as a side project for me to learn Angular JS and improve my web development skills, an area I used to be lacking at. I design the whole side and develop it by myself. The responsive aspect of this site is also manually written, instead of using the popular frameworks like bootstrap, to gain finer control and better understanding of responsive design. The animated background was created using Particle.JS.",
          "timestring": "(December 2017 - Present)",
          "img": "/assets/img/works/thiswebsite.png"
        },
        {
          "title":"ViaBus Mobile Application:",
          "subtitle": "Android Development, iOS Consultation",
          "detail":"ViaBus is a mobile application, collaborated with BMTA and AIS, uses to provide information and calculate routes for public transportation such as buses and vans, in Thailand. The project was initiated by my seniors at Chulalongkorn University. I helped out with part of Android and iOS application development during a beta phase.",
          "timestring": "(July 2016- March 2017)",
          "img": "/assets/img/works/viabus.jpg",
          "link": "https://www.facebook.com/viabusapp/"
        },
        {
          "title":"Kaidee.com Class Project",
          "subtitle": "Group Member, Co-Leader",
          "detail":"A term project combining three subjects, Software Engineering, Database, and ICE Capstone. The project consisted of 9 people and span across 4 months. The project was collaborated with Kaidee.com to improve their system and website. Our group won first place and was liked the most by Kaidee’s member.",
          "timestring": "(Jan 2017 - May 2017)",
          "img": "/assets/img/works/kaidee.png"
        },
        {
          "title":"ISE Admission Website:",
          "subtitle": "UI Design, Front End Development",
          "detail":"A website allowing prospective students to select their major during the admission process. The project was request by the International School of Engineering, Chulalongkorn University.",
          "timestring": "(March 2016)",
          "img": "/assets/img/works/iseadmission.png",
          "link": "https://romsonpreechawit.me/2018/02/13/ise-ad/"
        },
        {
          "title":"Chula OpenHouse Application - 2015:",
          "subtitle": "iOS Development",
          "detail":"An application that show details and locations of booths within the Open House event. The app also contain a bingo game which can be played using QR code attaches to different booths in the event.",
          "timestring": "(October 2015 - November  2015)",
          "img": "/assets/img/works/chulaopenhouse.jpg",
          "link": "https://itunes.apple.com/th/app/cu-open-house/id1054344280?mt=8"
        },
        {
          "title":"Majide (Unity2D Bullet Hell Game):",
          "subtitle": "Structure Design and Development",
          "detail":"A top-down shooter, Danmakufu style game created as part of Advance Computer Programming class project.",
          "timestring": "(September 2015 - October 2015)",
          "img": "/assets/img/works/majide.png"
        },
        {
          "title":"Globish Mobile Application:",
          "subtitle": "iOS Development",
          "detail":"An application uses to view classes timetable for the Globish Academia English learning website. This is my first iOS Application and the first big programming project I have ever done. The development has since been passed on to another person, but this is still a big step for me. Check out their website at https://www.globish.co.th",
          "timestring": "(November 2014 - January 2015)",
          "img": "/assets/img/works/globish.jpg"
        }
      ]
  },
  {
    "section_title": "Activities",
    "works": [
        {
          "title":"Internship at ExxonMobil Limited",
          "subtitle": "Integration Team, Developer",
          "detail":"Worked in a team which manage changes going through to the SAP system from various other team. My job was to develop a chat bot system to be used internally, helping the team answer questions and queries received on a daily basis.",
          "timestring": "(June 1 2017 - July 31 2017)",
          "img":"/assets/img/works/exxoninterngroup.jpg"
        },
        {
          "title":"Thinc Inc.",
          "subtitle": "Lead iOS Consultation, iOS/Android Development",
          "detail":"Thinc is a students founded and maintained innovative organization aiming to make an impact on the public by using critical thinking and technology to solve various problems.",
          "timestring": "(2014 - Present)",
          "img":"/assets/img/works/thinc.png",
          "link": "https://www.thinc.in.th"
        },
        {
          "title":"ISE OpenHouse",
          "subtitle": "Staff, Booth Presentation",
          "detail":"OpenHouse festival uses to show off various works and projects, as well as, answering questions of each major for prospective students. During the 2016 festival, me and my friends made a simply Mobile Unity game called 'ICE Defender' specifically to promote our major in the OpenHouse.",
          "timestring": "(2015, 2016)",
          "img":"/assets/img/works/icedefender.png"
        },
        {
          "title":"Engineering Expo",
          "subtitle": "Staff, Booth Presentation",
          "detail":"Innovative festival where students can show their projects to outside people and various company.",
          "timestring": "(2015)",
          "img": "/assets/img/works/engexpo.jpg"
        }
      ]
  }
]
